# Parameters
nh: 1
nl: 2
pl: 7                  # feature map size
dl: 1024                # Number of hidden layer neurons
backbone: resnet50     # 0

Feature pyramid:
  # [from, number, module, args[ch_in, ch_out, kernel_size, strides]]
  [[0, 2, C2f_EMABo, [512, 512, False]],           # C3_C2f
   [-1, 1, Conv, [512, 1024, 1, 2]],          # C3_Conv

   [1, 2, C2f_EMABo, [1024, 1024, False]],          # C4_C2f
   [[-1, 2], 1, Add, []],                    # C4_Add
   [-1, 1, Conv, [1024, 2048, 1, 2]],         # C4_Conv

   [2, 2, C2f_EMABo, [2048, 2048, False]],        # C5_c2f
   [[-1, 5], 1, Add, []],                    # C5_Add
   [-1, 1, Conv, [2048, 1024, 1, 2]],         # C5_Conv
   [-1, 2, C2f_EMABo, [1024, 1024, False]],          # C5_C2f
   [-1, 1, Head, [1024, nh, nl, pl, dl]],     # [bs, nh * nl, nx, ny]
  ]